In [ ]:
import numpy as np
import pandas as pd

In [ ]:
m1=[1,2,3,4]

In [ ]:
df=pd.DataFrame(data=np.random.randint(1,21,(4,4)),index=[m1],columns=['a','b','c','d'])
df

    a   b   c   d
1  20  14  11  15
2  10   5   6   8
3   9  17   2   6
4  15   2  17   3

In [ ]:
df['b'] % 2==0

1     True
2    False
3    False
4     True
Name: b, dtype: bool

In [ ]:
d1 = {'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'c':[1,2,3]}

In [ ]:
df1=pd.DataFrame(d1)
df1

     A    B  c
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df1.isnull()

       A      B      c
0  False  False  False
1  False   True  False
2   True   True  False

In [ ]:
df1.isnull().sum()

A    1
B    2
c    0
dtype: int64

In [ ]:
df1.dropna()

     A    B  c
0  1.0  3.0  1

In [ ]:
df1.fillna(df1.mean())

     A    B  c
0  1.0  3.0  1
1  2.0  3.0  2
2  1.5  3.0  3

In [ ]:
df1.dropna(thresh=2)

     A    B  c
0  1.0  3.0  1
1  2.0  NaN  2

In [ ]:
df2=pd.DataFrame(
    {'Company':['GOOGLE','FB','MSFT','AMAZON','OREO'],
     'Emloyee':['alex','richel','joy','pheobe','sam'],
     'Sales':[120,200,300,400,50]}
)

In [ ]:
df2=pd.DataFrame(df2)
df2

  Company Emloyee  Sales
0  GOOGLE    alex    120
1      FB  richel    200
2    MSFT     joy    300
3  AMAZON  pheobe    400
4    OREO     sam     50

In [ ]:
df2['Sales'].mean()

214.0

In [ ]:
df2.groupby('Company')

In [ ]:
df2.groupby('Company').mean()

         Sales
Company
AMAZON     400
FB         200
GOOGLE     120
MSFT       300
OREO        50

In [ ]:
df2.groupby('Company').mean()

         Sales
Company
AMAZON     400
FB         200
GOOGLE     120
MSFT       300
OREO        50

In [ ]:
df2.groupby('Company').describe()

        Sales
        count   mean std    min    25%    50%    75%    max
Company
AMAZON    1.0  400.0 NaN  400.0  400.0  400.0  400.0  400.0
FB        1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
GOOGLE    1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
MSFT      1.0  300.0 NaN  300.0  300.0  300.0  300.0  300.0
OREO      1.0   50.0 NaN   50.0   50.0   50.0   50.0   50.0

In [ ]:
df2['Company'].unique()

array(['GOOGLE', 'FB', 'MSFT', 'AMAZON', 'OREO'], dtype=object)

In [ ]:
df2['Company'].nunique()

5

In [ ]:
df2['Company'].value_counts()

MSFT      1
AMAZON    1
OREO      1
FB        1
GOOGLE    1
Name: Company, dtype: int64

In [ ]:
def updateSales(sale):
  if sale<200:
    return sale + 100
  else:
    return sale

In [ ]:
df2['Sales'].apply(updateSales)

0    220
1    200
2    300
3    400
4    150
Name: Sales, dtype: int64

In [ ]:
df2['Sales'].apply(lambda s : s + 100)

0    220
1    300
2    400
3    500
4    150
Name: Sales, dtype: int64

In [ ]:
df1 = pd.read_csv